app/controllers/api/v1/health_entries_controller.rb

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" DESC  [["user_id", 2]]
---
      def index
        @health_entries = current_user.health_entries.order(date: :desc)