app/controllers/health_entries_controller.rb

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "health_entries" WHERE "health_entries"."user_id" = ?  [["user_id", 2]]
SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."user_id" = ? AND "health_entries"."date" = ? LIMIT ?  [["user_id", 2], ["date", "2026-04-22"], ["LIMIT", 1]]
SELECT "health_entries"."date", "health_entries"."mood" FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" ASC  [["user_id", 2]]
SELECT AVG("health_entries"."mood") FROM "health_entries" WHERE "health_entries"."user_id" = ? AND "health_entries"."date" BETWEEN ? AND ?  [["user_id", 1], ["date", "2026-04-14"], ["date", "2026-04-21"]]
SELECT "health_entries"."date", "health_entries"."energy" FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" ASC  [["user_id", 2]]
SELECT AVG("health_entries"."energy") FROM "health_entries" WHERE "health_entries"."user_id" = ? AND "health_entries"."date" BETWEEN ? AND ?  [["user_id", 1], ["date", "2026-04-14"], ["date", "2026-04-21"]]
SELECT AVG("health_entries"."sleep_hours") FROM "health_entries" WHERE "health_entries"."user_id" = ? AND "health_entries"."date" BETWEEN ? AND ?  [["user_id", 1], ["date", "2026-04-14"], ["date", "2026-04-21"]]
---
  def index
    @health_entries = current_user.health_entries.order(date: :desc).page(params[:page]).per(7)
    @last_7 = current_user.health_entries.where(date: 7.days.ago..Date.today)
    @avg_mood = @last_7.average(:mood)&.round(1)
    @avg_energy = @last_7.average(:energy)&.round(1)
    @avg_sleep = @last_7.average(:sleep_hours)&.round(1)
    @streak = HealthEntry.streak_for(current_user)
    @chart_data_mood = current_user.health_entries.order(date: :asc).pluck(:date, :mood).to_h
    @chart_data_energy = current_user.health_entries.order(date: :asc).pluck(:date, :energy).to_h
    @today_entry = current_user.health_entries.find_by(date: Date.today)

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @health_entry = HealthEntry.find(params[:id])

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @health_entry = HealthEntry.find(params[:id])

INSERT INTO "health_entries" ("mood", "energy", "sleep_hours", "water_litres", "notes", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @health_entry = current_user.health_entries.new(health_entry_params)

    if @health_entry.save

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "health_entries" SET "notes" = ?, "updated_at" = ? WHERE "health_entries"."id" = ?
---
  def update
    @health_entry = HealthEntry.find(params[:id])

    if @health_entry.update(health_entry_params)

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "health_entries" WHERE "health_entries"."id" = ?  [["id", 1]]
---
  def destroy
    @health_entry = HealthEntry.find(params[:id])
    @health_entry.destroy

SELECT "health_entries".* FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" DESC  [["user_id", 2]]
---
  def export
    @health_entries = current_user.health_entries.order(date: :desc)