app/models/health_entry.rb

SELECT "health_entries"."date" FROM "health_entries" WHERE "health_entries"."user_id" = ? ORDER BY "health_entries"."date" DESC  [["user_id", 1]]
---
  def self.streak_for(user)
    dates = user.health_entries.order(date: :desc).pluck(:date)